<a href="https://colab.research.google.com/github/moyanke/inf1340-programmingfordatascience-fa22/blob/main/MID__Sub_YankeMo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly
df = pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx')

In [3]:
table_01 = pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 1')
table_02= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 2')
table_03= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 3')
table_04= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 4')
table_05= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 5')
table_06= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 6')
table_annex= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='ANNEX')
table_notes= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='NOTES')

In [ ]:
table_01

In [ ]:
table_1_1 = table_01.drop(table_01.index[0:15])
table_1_1 #Drop 0-15 rows

In [6]:
table_1_1.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22'],
      dtype='object')

In [8]:
table_1_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990 Migrant Stock Both Sex',
                  '1995 Migrant Stock Both Sex','2000 Migrant Stock Both Sex','2005 Migrant Stock Both Sex',
                  '2010 Migrant Stock Both Sex','2015 Migrant Stock Both Sex','1990 Migrant Stock Male',
                  '1995 Migrant Stock Male','2000 Migrant Stock Male','2005 Migrant Stock Male','2010 Migrant Stock Male',
                  '2015 Migrant Stock Male','1990 Migrant Stock Female','1995 Migrant Stock Female)','2000 Migrant Stock Female',
                  '2005 Migrant Stock Female','2010 Migrant Stock Female',
                  '2015 Migrant Stock Female']

In [ ]:
table_1_1 #rename the columns

In [13]:
tidy_table_01 = table_1_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Year",value_name="Migrant Stock")

In [14]:
tidy_table_01

,Order,Name of Area,Notes,Country Code,Type of Data(a),Year,Migrant Stock
0,1,WORLD,NaN,900,NaN,1990 Migrant Stock Both Sex,152563212
1,2,Developed regions,(b),901,NaN,1990 Migrant Stock Both Sex,82378628
2,3,Developing regions,(c),902,NaN,1990 Migrant Stock Both Sex,70184584
3,4,Least developed countries,(d),941,NaN,1990 Migrant Stock Both Sex,11075966
4,5,Less developed regions excluding least develop...,NaN,934,NaN,1990 Migrant Stock Both Sex,59105261
...,...,...,...,...,...,...,...
4765,261,Samoa,NaN,882,B,2015 Migrant Stock Female,2460.0
4766,262,Tokelau,NaN,772,B,2015 Migrant Stock Female,254.0
4767,263,Tonga,NaN,776,B,2015 Migrant Stock Female,2604.0
4768,264,Tuvalu,NaN,798,C,2015 Migrant Stock Female,63.0
4769,265,Wallis and Futuna Islands,NaN,876,B,2015 Migrant Stock Female,1411.0

In [16]:
tidy_table_01=(tidy_table_01.assign(year = lambda x: x.Year.str[:4].astype(str), Gender = lambda x: x.Year.str[18:].astype(str)).drop("Year",axis=1))
tidy_table_01 #Separate the Year cloumns into year, gemder, migrant stock

,Order,Name of Area,Notes,Country Code,Type of Data(a),Migrant Stock,year,Gender
0,1,WORLD,NaN,900,NaN,152563212,1990,Both Sex
1,2,Developed regions,(b),901,NaN,82378628,1990,Both Sex
2,3,Developing regions,(c),902,NaN,70184584,1990,Both Sex
3,4,Least developed countries,(d),941,NaN,11075966,1990,Both Sex
4,5,Less developed regions excluding least develop...,NaN,934,NaN,59105261,1990,Both Sex
...,...,...,...,...,...,...,...,...
4765,261,Samoa,NaN,882,B,2460.0,2015,Female
4766,262,Tokelau,NaN,772,B,254.0,2015,Female
4767,263,Tonga,NaN,776,B,2604.0,2015,Female
4768,264,Tuvalu,NaN,798,C,63.0,2015,Female
4769,265,Wallis and Futuna Islands,NaN,876,B,1411.0,2015,Female

In [ ]:
table_02

In [ ]:
table_2_1 = table_02.drop(table_02.index[0:15])
table_2_1 #Drop 0-15 rows

In [ ]:
table_2_1.columns

In [ ]:
table_2_1.columns=['Order','Name of Area','Notes','Country Code','1990 Total Population Both Sex',
                  '1995 Total Population Both Sex','2000 Total Population Both Sex','2005 Total Population Both Sex',
                  '2010 Total Population Both Sex','2015 Total Population Both Sex','1990 Total Population Male',
                  '1995 Total Population Male','2000 Total Population Male','2005 Total Populatio Male','2010 Total Population Male',
                  '2015 Total Population Male','1990 Total Population Female','1995 Total Population Female)','2000 Total Population Female',
                  '2005 Total Population Female','2010 Total Population Female',
                  '2015 Total Population Female']

In [ ]:
table_2_1

In [ ]:
tidy_table_02 = table_2_1.melt(id_vars=["Order","Name of Area","Notes","Country Code"],var_name="Year",value_name="Total Population")

In [ ]:
tidy_table_02

In [17]:
tidy_table_02=(tidy_table_02.assign(year = lambda x: x.Year.str[:4].astype(str), Gender = lambda x: x.Year.str[22:].astype(str)).drop("Year",axis=1))
tidy_table_02 #Separate the Year cloumns into year, gemder, total population

NameError: ignored

maybe we can split 1990, 1995, 2000...into different column,based on the 
notebooks in the Guthub, can we used NaN in it.

In [ ]:
#write up of what violation you find, five page at least with picture. 
#use table_01.set_index("Name of area", inpplace = True)把name of area 变成中心指标